#task3
#Напишите программу, которая принимает две строки вида “a/b” - дробь с числителем и знаменателем. 
#Программа должна возвращать сумму и произведение* дробей. 
#Для проверки своего кода используйте модуль fractions.

from fraction import Fraction


if __name__ == "__main__":
    print("Эта программа для расчёта произведения и суммы дробей")
    print("Формат вводимых данных: \"a/b\"")
    num1 = input("Введите первое число: ")
    num2 = input("Введите второе число")
    


